tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "fzf"
brew "graphviz"
brew "hstr"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "node"
brew "nodenv"
brew "postgresql@9.6", restart_service: true, link: true
brew "ruby-build", args: ["HEAD"]
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "tig"
brew "tmux"
brew "watch"
brew "wget"
brew "yarn"
brew "heroku/brew/heroku"
