tap "adoptopenjdk/openjdk"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "ca-certificates"
brew "asdf"
brew "awscli"
brew "bash-completion"
brew "glib"
brew "ctags"
brew "direnv"
brew "edencommon"
brew "exiftool"
brew "fzf"
brew "gh"
brew "git"
brew "git-absorb"
brew "python@3.9"
brew "tcl-tk"
brew "glib"
brew "lynx"
brew "mcfly"
brew "ncdu"
brew "nmap"
brew "node", link: false
brew "pkg-config"
brew "node-build"
brew "nvm"
brew "postgresql@14"
brew "python@3.10"
brew "ruby-build"
brew "rbspy"
brew "rcm"
brew "redis"
brew "sysbench"
brew "thefuck"
brew "tmux"
brew "tree"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh-completions"
brew "heroku/brew/heroku"
cask "alt-tab"
cask "barrier"
