# --- TAPS: extra formula/cask repositories ---
tap "heroku/brew"

# --- CORE UTILITIES ---
brew "ca-certificates"     # Updated root certificates
brew "glib"                # Low-level core library used by many tools
brew "pkg-config"          # Helps compile C/C++ projects with dependencies

# --- SHELL & CLI ENHANCEMENTS ---
brew "bash-completion"     # Bash tab completion
brew "direnv"              # Load/unload env vars based on `cd` location
brew "fzf"                 # Fuzzy finder for the terminal
brew "mcfly"               # Smarter shell history with fuzzy search
brew "rcm"                 # Dotfile manager
brew "thefuck"             # Correct previous shell commands
brew "tmux"                # Terminal multiplexer
brew "watch"               # Run shell commands repeatedly
brew "zsh-completions"     # Zsh tab completion

# --- DEVELOPMENT ENVIRONMENTS ---
brew "asdf"                # Version manager for multiple languages
brew "ruby-build"          # Install Ruby versions (for rbenv or asdf)
brew "python@3.15"         # Specific Python version
brew "node"                # Node.js runtime
brew "postgresql@17"       # PostgreSQL 17 for local dev DB
brew "redis"               # In-memory key-value store

# --- DEVELOPMENT TOOLS ---
brew "awscli"              # AWS CLI v2
brew "ctags"               # Generate tags for code navigation
brew "exiftool"            # Read/write image metadata
brew "gh"                  # GitHub CLI
brew "git"                 # Git version control
brew "git-absorb"          # Create autosquash commits from fixups
brew "jq"                  # Command-line JSON parser
brew "lynx"                # Terminal-based web browser
brew "ncdu"                # Disk usage analyzer (terminal UI)
brew "nmap"                # Network port scanner
brew "rbspy"               # Ruby method-level profiler
brew "ripgrep"             # Fast file searcher (`rg`)
brew "sysbench"            # Benchmarking tool for DB/load

# --- PACKAGE MANAGERS ---
brew "yarn"                # JS package manager

# --- DOWNLOADERS / FILE HANDLING ---
brew "wget"                # HTTP(S) downloader

# --- HEROKU ---
brew "heroku/brew/heroku"  # Heroku CLI

# --- GUI TOOLS ---
cask "alt-tab"             # macOS window switcher like Windows Alt+Tab
